app/models/event.rb

  def same_place
    event = Event.where(:event_venue => event_venue).where(:start_date => start_date).count()
---
SELECT COUNT(*) FROM "events" WHERE "events"."event_venue_id" = ? AND "events"."start_date" = ?  [["event_venue_id", 1], ["start_date", "2019-03-01"]]