app/models/ticket.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def ticket_future_event
    event = Event.find(event.id)